  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Navigationsbereich  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Leeres Script, damit in IE5.0-Fenstern Tabellen- und Schaltfl&auml;chenrahmen gezeichnet werden --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgcm"></A><h3>Navigationsbereich</h3>
<p>Im Navigationsbereich k&ouml;nnen Sie die Organisations- und Dom&auml;nenb&auml;ume nach Elementen durchsuchen. Die Baumstruktur spiegelt die Hierarchie der Elemente wider. Verf&uuml;gt ein Knoten &uuml;ber Unterknoten, wird links vom Knotennamen ein blaues Dreieck angezeigt. Durch Klicken auf dieses Dreieck k&ouml;nnen Sie den Knoten erweitern, sodass einige Unterknoten angezeigt werden.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Standardm&auml;&szlig;ig werden f&uuml;r jeden erweiterten Knoten nur 10 Unterknoten angezeigt. Gibt es mehr als 10 Unterknoten, verweist der 11. &#8220;Knoten&#8221; nicht auf ein Element, sondern gibt an, dass es weitere Knoten gibt, die nicht angezeigt werden: &#8220;... einige Elemente nicht angezeigt&#8221;. Durch Klicken auf diesen &#8220;Knoten&#8221; k&ouml;nnen Sie die Suchfunktion &ouml;ffnen.</p>
<hr size="1" noshade></p><p>Um ein Element auszuw&auml;hlen, navigieren Sie in der Baumstruktur und klicken Sie auf das gew&uuml;nschte Element. Wurde ein Element ausgew&auml;hlt, wird es hervorgehoben und im Inhaltsbereich werden die zugewiesenen und &uuml;bernommenen Profile des Elements angezeigt.</p>
<p>Im Navigationsbereich sind au&szlig;erdem eine rekursive Suche (siehe <A HREF="gbgpa.html#gbgpa">Suchen nach Elementen</A>) und eine nicht-rekursive Suche (siehe <A HREF="gbgqt.html#gbgqt">Verwenden der Suchfunktion</A>) f&uuml;r die Suche nach Elementen in den Baumhierarchien verf&uuml;gbar. Durch Klicken auf die Schaltfl&auml;che &#8220;Suchen&#8221; wird das gleichnamige Fenster ge&ouml;ffnet.</p>
<br />
</body>
</html>
