  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Einf&uuml;hrung  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Leeres Script, damit in IE5.0-Fenstern Tabellen- und Schaltfl&auml;chenrahmen gezeichnet werden --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgce"></A><h2>Einf&uuml;hrung</h2>
<p>Desktop Manager ist ein Tool f&uuml;r die zentralisierte Verwaltung der Konfigurationseinstellungen von Desktopanwendungen, die man als <i>Profile</i> bezeichnet. Mit Desktop Manager k&ouml;nnen Sie den Elementen der Hierarchie einer Organisation oder einer Dom&auml;ne Profile zuweisen und diese Profile anzeigen lassen. Profile werden angewendet, wenn ein Benutzer eine Desktop-Sitzung oder eine von Desktop Manager verwaltete Anwendung startet. Alle Profile, die f&uuml;r den Benutzer oder den Host, auf dem die Anwendung l&auml;uft, relevant sind, werden abgerufen und ihre Einstellungen werden aus den lokalen Vorgaben f&uuml;r die Anwendung und den benutzerdefinierten Einstellungen des entsprechenden Benutzers zusammengef&uuml;hrt. Mit Profilen kann ein Satz zentral verwalteter Vorgaben f&uuml;r die Anwendung bereitgestellt werden oder es k&ouml;nnen vorgeschriebene Einstellungen durchgesetzt werden.</p>
<p>Verwendete Begriffe:</p>
<ul><li><p><i>Konfigurationsdatensammlung</i>: Der Organisations- und Dom&auml;nenbaumbeh&auml;lter mit den darin gespeicherten Profilen</p>
</li>
<li><p><i>Dom&auml;ne</i>: Element im Dom&auml;nenbaum. Sie ist ein bestimmter Bereich eines Computernetzwerks. Sie kann Dom&auml;nen und Hosts enthalten.</p>
</li>
<li><p><i>Element</i>: Ein logisches Objekt, dem Konfigurationsdaten zugewiesen werden k&ouml;nnen. Beispiele f&uuml;r Entit&auml;ten, die Desktop Manager bekannt sind, sind Benutzer, Rollen/Gruppen und Organisationen.</p>
</li>
<li><p><i>LDAP</i>: Lightweight Directory Access Protocol. LDAP ist ein Verzeichnisdienstprotokoll f&uuml;r TCP/IP. Die Funktionsweise von LDAP wird in RFC 1777 (&#8220;The Lightweight Directory Access Protocol&#8221;) definiert.</p>
</li>
<li><p><i>Organisation</i>: Ein Element im Organisationsbaum. Sie stellt ein Unternehmen bzw. einen Unternehmensbereich dar (beipielsweise ?Callcenter?). Organisationen k&ouml;nnen Organisationen, Benutzer oder Rollen enthalten.</p>
</li>
<li><p><i>Profil</i>: Ein benannter Beh&auml;lter f&uuml;r Konfigurationseinstellungen. Profile werden in Konfigurationsdatensammlungen gespeichert und k&ouml;nnen Elementen zugewiesen werden.</p>
</li>
</ul>
<br />
</body>
</html>
