  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Erweiterte Optionen  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Leeres Script, damit in IE5.0-Fenstern Tabellen- und Schaltfl&auml;chenrahmen gezeichnet werden --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgdh"></A><h3>Erweiterte Optionen</h3>
<p>Auf der Seite &#8220;Erweiterte Optionen&#8221; k&ouml;nnen Sie die erweiterten Optionen f&uuml;r das aktuelle Profil festlegen. Auf dieser Seite stehen zwei Hauptfunktionen zur Verf&uuml;gung:</p>
<ul><li><p>Anwendbar von: Erm&ouml;glicht das Verschieben des Profils an einen anderen Speicherort im Organisations- oder Dom&auml;nenbaum. Durch Verschieben des Speicherorts &auml;ndern Sie auch den Satz von Elementen, denen das Profil zugewiesen beziehungsweise auf die es angewendet werden kann. Dies liegt daran, dass ein Profil nur dem Element zugewiesen werden kann, an dem es gespeichert werden kann, beziehungsweise den Elementen zugewiesen werden kann, die sich unterhalb des Elements befinden, an dem es gespeichert ist.</p>
<hr size="1" noshade><p><IMG ALT="Caution" src="graphics/caution.gif"> <b>Warnung &#8211; </b>Es ist nicht m&ouml;glich, den Parameter &#8220;Anwendung von&#8221; so zu &auml;ndern, dass das daraus resultierende Layout gegen die oben erw&auml;hnte Regel verst&ouml;&szlig;t. Dies k&ouml;nnte beispielsweise passieren, wenn Sie ein Profil in der Hierarchie nach unten verschieben und eine vorhandene Zuweisung, die das Profil mit einem Element unterhalb des Speicherorts des Profils verbindet, das Profil mit demselben Element verbinden w&uuml;rde, nachdem das Element verschoben wurde. Nun befindet sich das Element jedoch oberhalb des Speicherorts des Profils. Versuchen Sie dies, wird der Vorgang abgebrochen und eine Warnmeldung wird angezeigt.</p><hr size="1" noshade></li>
<li><p>Zusammenf&uuml;hrungsreihenfolge: Gibt an, in welcher Reihenfolge alle an demselben Element gespeicherten Profile zusammengef&uuml;hrt werden. </p>
<p>Da einem einzelnen Element mehrere Profile zugewiesen werden k&ouml;nnen und mehrere Profile dieselbe Einstellung festlegen k&ouml;nnen, muss die Reihenfolge der Zusammenf&uuml;hrung der Profile f&uuml;r ein einzelnes Element bestimmt werden. Auf diese Weise werden Konflikte behoben, wenn eine Einstellung in zwei oder mehr Profilen definiert ist, die demselben Element zugewiesen sind.</p>
<p>Der Speicherort wird als Erstes zur Bestimmung der Zusammenf&uuml;hrungsreihenfolge herangezogen. Das Profil, das an einem Element gespeichert ist, das n&auml;her an der Root des Baums ist, wird als Erstes zusammengef&uuml;hrt. Das tiefer in der Baumhierarchie gespeicherte Profil wird folglich danach gespeichert. Die Einstellungen eines sp&auml;ter zusammengf&uuml;hrten Profils &uuml;berschreiben die Einstellungen eines fr&uuml;her zusammengef&uuml;hrten Profils.</p>
</li>
</ul>
<p>Siehe <A HREF="gbgqu.html#gbgqu">&Auml;ndern des Speicherorts f&uuml;r &#8220;Anwendung von&#8221;</A>, <A HREF="gbgqe.html#gbgqe">Zuweisen von Zusammenf&uuml;hrungsreihenfolgen zu Profilen</A></p>
<br />
</body>
</html>
