  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Anzeigen und Bearbeiten der Konfigurationseinstellungen von Profilen  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Leeres Script, damit in IE5.0-Fenstern Tabellen- und Schaltfl&auml;chenrahmen gezeichnet werden --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgot"></A><h4>Anzeigen und Bearbeiten der Konfigurationseinstellungen von Profilen</h4>
<h5>Schritte</h5><ol><li><p><b>Um eine bestimmte Konfigurationseinstellung eines Profils anzuzeigen, k&ouml;nnen Sie sie im rechten Bereich der Seite in der Kategorienliste ausw&auml;hlen.</b></p><p>Die Konfigurationseinstellungen sind auf hierarchische Weise in Kategorien unterteilt, die direkt den Konfigurationsoptionen von Desktopanwendungen wie StarOffice™, Mozilla™, Evolution oder Gnome entsprechen. </p>
</li>
<li><p><b>Klicken Sie auf die gew&uuml;nschte Konfigurationseinstellung.</b></p><p>Die Einstellungen des ausgew&auml;hlten Profils werden angezeigt, die alle verf&uuml;gbaren Einstellungen f&uuml;r dieses Profil angeben. Bei Bedarf werden zus&auml;tzliche Kontextinformationen, beispielsweise zu den Auswirkungen einzelner Einstellungen oder zu den zul&auml;ssigen Werten, angegeben. </p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Wenn Sie statt einer Konfigurationseinstellung eine Kategorie ausw&auml;hlen, wird eine Liste mit den Einstellungen oder Unterkategorien dieser Kategorie angezeigt.</p>
<hr size="1" noshade></p></li>
<li><p><b>Sie k&ouml;nnen f&uuml;r jede Konfigurationseinstellung entweder einen bestimmten Wert angeben oder die Einstellung nicht definieren.</b></p><p>Definieren Sie eine Einstellung nicht, ist die Anwendung nicht von dieser Profileinstellung betroffen und verwendet den anwendungseigenen Vorgabewert. Im Allgemeinen zeigt der Profileditor den Vorgabewert einer Anwendung in einem zus&auml;tzlichen Hilfetext oder - falls m&ouml;glich - direkt in der Optionsliste der Einstellung an.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Beachten Sie stets, dass mehrere Profile Auswirkungen auf denselben Benutzer haben k&ouml;nnen. Beispiel: Sie erstellen ein Profil mit Einstellungen f&uuml;r eine bestimmte Organisation. Diese Einstellungen stehen automatisch allen Benutzern zur Verf&uuml;gung, die Teil dieser Organisation sind. &Auml;hnlich verh&auml;lt es sich, wenn Sie zus&auml;tzliche Profile mit Konfigurationseinstellungen f&uuml;r Unterorganisationen definieren. Diese k&ouml;nnen Einstellungen der &uuml;bergeordneten Organisation &uuml;berschreiben (beispielsweise wenn f&uuml;r Unterorganisationen andere Proxy-Einstellungen festgelegt wurden), andere Einstellungen jedoch unber&uuml;hrt lassen. F&uuml;r einen bestimmten Benutzer w&uuml;rden in diesem Fall Einstellungen gelten, die das Ergebnis einer Zusammenf&uuml;hrung w&auml;ren, die alle der Organisation, den Unterorganisationen und m&ouml;glicherweise dem Benutzer zugewiesenen Profile einschlie&szlig;t. </p>
<hr size="1" noshade></p><p><hr size="1" noshade><p><b>Tipp &#8211; </b>In einigen F&auml;llen ist es ratsam, diese Zusammenf&uuml;hrung zu steuern und eine bestimmte Konfigurationseinstellung zu erzwingen, sodass andere Profile diese Einstellung nicht &uuml;berschreiben und einen anderen Wert definieren k&ouml;nnen. Im Profileditor k&ouml;nnen Sie f&uuml;r jede Einstellung das gew&uuml;nschte Zusammenf&uuml;hrungsverhalten ausw&auml;hlen. Die Standardeinstellung ist, dass andere Profile eine Einstellung &uuml;berschreiben k&ouml;nnen. Wenn Sie diese Option deaktivieren, wird die Einstellung erzwungen, das hei&szlig;t andere Profile k&ouml;nnen den von Ihnen festgelegten Wert nicht &uuml;berschreiben.</p>
<hr size="1" noshade></p></li>
</ol>
<br />
</body>
</html>
