  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Anzeigen der geltenden Einstellungen  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Leeres Script, damit in IE5.0-Fenstern Tabellen- und Schaltfl&auml;chenrahmen gezeichnet werden --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgoz"></A><h3>Anzeigen der geltenden Einstellungen</h3>
<p>&#8220;Geltende Einstellungen&#8221; ist eine Ansicht der geltenden Konfigurationseinstellungen f&uuml;r ein bestimmtes Element (beispielsweise eine Organisation, eine Dom&auml;ne oder einen Host), in der keine &Auml;nderungen vorgenommen werden k&ouml;nnen.</p>
<p>Die geltenden Einstellungen eines bestimmten Benutzers sind das Ergebnis einer Zusammenf&uuml;hrung, die die bei den beteiligten Organisationsebenen, Rollen und beim Benutzer gespeicherten Konfigurationseinstellungen einbezieht. Die zusammengef&uuml;hrten Konfigurationseinstellungen eines ausgew&auml;hlten Elements in einem separaten Fenster des Typs &#8220;Geltende Einstellungen&#8221; anzeigen lassen. Dies erm&ouml;glicht eine einfache &Uuml;berpr&uuml;fung und Fehlersuche. Ein Bericht vom Typ &#8220;Geltende Einstellungen&#8221; kann auch ausgedruckt und zu Archivierungszwecken aufbewahrt werden.</p>
<h5>Schritte</h5><ol><li><p><b>Klicken Sie in der Tabelle &#8220;Zugewiesene Profile&#8221; auf die Schaltfl&auml;che &#8220;Geltende Einstellungen&#8221;.</b></p><p>Beim ersten &Ouml;ffnen werden die geltenden Einstellungen f&uuml;r das im Navigationsbaum ausgew&auml;hlte Element angezeigt.</p>
<p>Das Fenster &#8220;Geltende Einstellungen&#8221; ist in zwei Bereiche unterteilt:</p>
<ul><li><p>Im Bereich &#8220;Geltende Einstellungen generieren mit&#8221; des Abschnitts &#8220;Parameter f&uuml;r geltende Einstellungen &auml;ndern&#8221; k&ouml;nnen Sie festlegen, welche B&auml;ume einbezogen werden sollen. Mithilfe der Option &#8220;W&auml;hlen Sie ein Element aus dem Dom&auml;nenbaum aus&#8221; k&ouml;nnen Sie ausw&auml;hlen, f&uuml;r welche Entit&auml;ten ein Bericht vom Typ &#8220;Geltende Einstellungen&#8221; generiert werden soll. Verwenden Sie die Schaltfl&auml;che &#8220;Durchsuchen&#8221;, um im Organisations- oder Dom&auml;nenbaum ein Element auszuw&auml;hlen.</p>
</li>
<li><p>Im Abschnitt &#8220;Geltende Einstellungen&#8221; wird Folgendes angezeigt:</p>
<ul><li><p>Position des ausgew&auml;hlten Elements in der Hierarchie und der Hostname</p>
</li>
<li><p>Uhrzeit und Datum der Erstellung des aktuellen Berichts f&uuml;r die geltenden Einstellungen</p>
</li>
<li><p>Liste der Profile, die vom Generieren des Berichts f&uuml;r die geltenden Einstellungen f&uuml;r das aktuelle Element betroffen sind (Abschnitt &#8220;Betroffene Profile&#8221;) Sie werden absteigend nach Relevanz in der Zusammenf&uuml;hrungsreihenfolge angezeigt. Jedes Profil ist ein Link, auf den Sie klicken k&ouml;nnen, um das Fenster &#8220;Profileditor&#8221; f&uuml;r das Profil zu &ouml;ffnen.</p>
</li>
<li><p>Im Bereich &#8220;Einstellungs&uuml;bersicht&#8221; werden die Konfigurationseinstellungen f&uuml;r den aktuellen Bericht f&uuml;r die geltenden Einstellungen in Kategorien gruppiert angezeigt. Dieser Bereich enth&auml;lt die Felder &#8220;Name&#8221;, &#8220;Wert&#8221; und &#8220;Status&#8221;.</p>
<p>Die Statusspalte enth&auml;lt Eintr&auml;ge der Art &#8220;Definiert in &lt;Profilname>&#8221;, wobei &lt;Profilname> ein Link ist, mit dem Sie das Register &#8220;Konfigurationseinstellungen&#8221; des Profileditors aufrufen und zur entsprechenden Einstellung innerhalb dieses Profils wechseln k&ouml;nnen.</p>
</li>
</ul>
</li>
</ul>
</li>
<li><p><b>Sie k&ouml;nnen einen bereits generierten Bericht f&uuml;r die geltenden Einstellungen bearbeiten, indem Sie relevante Parameter der geltenden Einstellungen &auml;ndern und anschlie&szlig;end im oberen Bereich des Fensters &#8220;Geltende Einstellungen&#8221; auf die Schaltfl&auml;che &#8220;Geltende Einstellungen generieren&#8221; klicken.</b> </p><p>Ein neuer Bericht wird erstellt und im Fenster &#8220;Geltende Einstellungen&#8221; angezeigt.</p>
</li>
<li><p><b>Wenn Sie einen Bericht f&uuml;r die geltenden Einstellungen ausdrucken m&ouml;chten, klicken Sie im oberen bzw. unteren Bereich des Fensters &#8220;Geltende Einstellungen&#8221; auf die Schaltfl&auml;che &#8220;Drucken&#8221;.</b></p></li>
</ol>
<br />
</body>
</html>
