  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Suchen nach Elementen  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Leeres Script, damit in IE5.0-Fenstern Tabellen- und Schaltfl&auml;chenrahmen gezeichnet werden --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgpa"></A><h4>Suchen nach Elementen</h4>
<p>Mit der Suchfunktion k&ouml;nnen Sie eine rekursive Suche nach einem Element in der Dom&auml;nen- oder Organisationshierarchie durchf&uuml;hren. Es werden nicht nur die direkt untergeordneten Elemente eines Elements gesucht, sondern alle untergeordneten Elemente. Es steht au&szlig;erdem eine Suchfunktion zur Verf&uuml;gung, mit der Sie ausschlie&szlig;lich nach Elementen suchen k&ouml;nnen, die einem anderen Element direkt untergeordnet sind.</p>
<p>Bei einer Suche wird das Fenster &#8220;Suchen&#8221; ge&ouml;ffnet, in dem Sie eine erweiterte Suche durchf&uuml;hren k&ouml;nnen.</p>
<h5>Schritte</h5><ol><li><p><b>Geben Sie in das Suchfeld den Namen beziehungsweise einen Teil des Namens eines Elements ein, nach dem Sie suchen m&ouml;chten.</b></p><p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Die Suche unterscheidet nicht nach Gro&szlig;- und Kleinschreibung und ist nicht streng. Das hei&szlig;t beispielsweise, dass f&uuml;r den Suchbegriff &#8220;bc&#8221; die Elemente &#8220;ABC&#8221; und &#8220;bcd&#8221; gefunden werden. Ein Asterisk (*) stellt eine beliebige Zeichenfolge in einem Suchbegriff dar. Der Suchbegriff kann mehrere Asteriske enthalten und ihre Position innerhalb des Suchbegriffs ist frei w&auml;hlbar. Ein leeres Feld entspricht dem Suchbegriff &#8220;*&#8221;.</p>
<hr size="1" noshade></p></li>
<li><p><b>Klicken Sie auf die Schaltfl&auml;che &#8220;Suchen&#8221;.</b></p><p>Das Fenster "Suchen" wird aufgerufen. Eine in das Suchfeld des Navigationsbereichs eingegebene Zeichenfolge wird in das Suchfeld des Fensters &#8220;Suchen&#8221; &uuml;bernommen und es wird automatisch eine Suche nach diesem Suchbegriff durchgef&uuml;hrt. Die Treffer der Suche werden in der Ergebnistabelle aufgef&uuml;hrt, die den Namen, Typ und Pfad aller gefundenen Elemente anzeigt.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Es werden maximal 100 Suchergebnisse angezeigt.</p>
<hr size="1" noshade></p><p>Wurden keine Ergebnisse gefunden oder haben Sie das Suchfeld im Navigationsbereich leer gelassen, k&ouml;nnen Sie im Suchfeld des Fensters &#8220;Suchen&#8221; den Namen eines Elements eingeben. </p>
<p><hr size="1" noshade><p><b>Tipp &#8211; </b>Verwenden Sie die Liste zum &Auml;ndern des Typs, die sich neben dem Suchfeld befindet, um nach Elementen eines bestimmten Typs (beispielsweise &#8220;Dom&auml;nen suchen&#8221;) zu suchen.</p>
<hr size="1" noshade></p></li>
<li><p><b>Bei Bedarf k&ouml;nnen Sie auf die Schaltfl&auml;che &#8220;Erweiterte Optionen anzeigen&#8221; klicken, um der Suche erweiterte Optionen hinzuzuf&uuml;gen.</b></p><p>Folgende erweiterte Optionen stehen zur Verf&uuml;gung:</p>
<ul><li><p>Beschr&auml;nken auf: Hier k&ouml;nnen Sie angeben, bei welchem Element der Suchalgorithmus die Suche im Baum beginnen soll.</p>
</li>
<li><p>Angezeigte Ergebnisse pro Seite: Hier k&ouml;nnen Sie festlegen, wie viele Ergebnisse auf jeder Seite der Ergebnistabelle angezeigt werden sollen.</p>
</li>
</ul>
</li>
<li><p><b>Klicken Sie erneut auf die Schaltfl&auml;che &#8220;Suchen&#8221;, um die Ergebnisse einer neuen oder ge&auml;nderten Suche anzuzeigen.</b></p><p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Durch Klicken auf die Schaltfl&auml;che &#8220;Zur&uuml;cksetzen&#8221; werden alle Suchparameter auf ihre Vorgaben zur&uuml;ckgesetzt und ein gegebenenfalls im Suchfeld eingegebener Suchbegriff wird gel&ouml;scht.</p>
<hr size="1" noshade></p></li>
</ol>
<br />
</body>
</html>
