  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Synchronisieren von Konfigurationsdatensammlungen  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Leeres Script, damit in IE5.0-Fenstern Tabellen- und Schaltfl&auml;chenrahmen gezeichnet werden --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgqm"></A><h4>Synchronisieren von Konfigurationsdatensammlungen</h4>
<p>Mit Desktop Manager k&ouml;nnen Sie mehrere Datenquellen parallel verwalten. Dies erm&ouml;glicht es, eine Datenquelle als Test- und eine andere als Produktionssystem zu definieren. &Auml;nderungen an der Konfiguration k&ouml;nnen nun zun&auml;chst auf dem Testsystem vorgenommen und getestet werden. Anschlie&szlig;end k&ouml;nnen Sie die Testdatenquelle teilweise oder vollst&auml;ndig mit der Produktionsdatenquelle <i>synchronisieren</i>, um die erforderlichen &Auml;nderungen schnell und sicher auf dem Produktionssystem vorzunehmen. Diese Methode kann auch f&uuml;r einfache Sicherungs- und Wiederherstellungszwecke f&uuml;r die Produktionsdatenquelle verwendet werden. Diese Synchronisation k&ouml;nnen Sie im Fenster &#8220;Synchronisation&#8221; durchf&uuml;hren.</p>
<p></p>
<h5>Schritte</h5><ol><li><p><b>W&auml;hlen Sie im Fenster &#8220;Konfigurationsdatensammlungen&#8221; die zu synchronisierenden Datensammlungen aus.</b></p><p>Das Fenster &#8220;Synchronisation&#8221; wird ge&ouml;ffnet.</p>
</li>
<li><p><b>W&auml;hlen Sie die Quelldatensammlung aus der Liste &#8220;Quellkonfigurationsdatensammlung&#8221; aus.</b></p><p>Sie k&ouml;nnen die Quelldatensammlung, die als Quelle f&uuml;r die &Auml;nderungen dient, &auml;ndern. Diese Datensammlung wird <i>nicht</i> ge&auml;ndert. </p>
</li>
<li><p>(Optional) <b>Sie k&ouml;nnen die Quelldatensammlung einschr&auml;nken, indem Sie neben &#8220;Quellstartpunkt&#8221; auf die Schaltfl&auml;che &#8220;&Auml;ndern&#8221; klicken.</b></p><p>Auf diese Weise k&ouml;nnen Sie ein anderes Element als die Wurzel als Quellstartpunkt f&uuml;r die Synchronisation angeben.</p>
<p>Ein Dialogfeld wird ge&ouml;ffnet, in dem Sie zum gew&uuml;nschten Organisations- oder Dom&auml;nenelement wechseln k&ouml;nnen. Ist ein neues Element ausgew&auml;hlt, wird der neue Pfad unter &#8220;Quellstartpunkt&#8221; angezeigt.</p>
</li>
<li><p><b>W&auml;hlen Sie die Zieldatensammlung aus der Liste &#8220;Zielkonfigurationsdatensammlung&#8221; aus.</b></p><p>Sie k&ouml;nnen die Zieldatensammlung, die als Ziel f&uuml;r die &Auml;nderungen dient, &auml;ndern. Diese Datensammlung <i>wird</i> ge&auml;ndert. </p>
</li>
<li><p>(Optional) <b>Sie k&ouml;nnen die Zieldatensammlung einschr&auml;nken, indem Sie neben &#8220;Zielstartpunkt&#8221; auf die Schaltfl&auml;che &#8220;&Auml;ndern&#8221; klicken.</b> </p><p>Auf diese Weise k&ouml;nnen Sie ein anderes Element als Ziel f&uuml;r die Synchronisation angeben.</p>
<p>Ein Dialogfeld wird ge&ouml;ffnet, in dem Sie zum gew&uuml;nschten Organisations- oder Dom&auml;nenelement wechseln k&ouml;nnen. Ist ein neues Element ausgew&auml;hlt, wird der neue Pfad unter &#8220;Zielstartpunkt&#8221; angezeigt.</p>
</li>
<li><p><b>Klicken Sie auf die Schaltfl&auml;che &#8220;Vergleichen&#8221;.</b></p><p>Die beiden B&auml;ume werden verglichen und die Unterschiede in einer Tabelle aufgef&uuml;hrt. </p>
</li>
<li><p><b>W&auml;hlen Sie die Kontrollk&auml;stchen neben den Tabellenzeilen mit den zu synchronisierenden Profilen aus und klicken Sie auf die Schaltfl&auml;che &#8220;Synchronisieren&#8221;.</b> </p><p>Nach Abschluss der Synchronisation entsprechen die Profile in der Zieldatensammlung denen der Quelldatensammlung.</p>
</li>
</ol>
<br />
</body>
</html>
