  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Introducci&oacute;n  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgce"></A><h2>Introducci&oacute;n</h2>
<p>Desktop Manager es una herramienta para la administraci&oacute;n centralizada de los valores de configuraci&oacute;n, denominados <i>perfiles</i>, para aplicaciones de escritorio. Mediante Desktop Manager se ven y asignan perfiles a los distintos elementos que componen la jerarqu&iacute;a de una organizaci&oacute;n o dominio. Los perfiles se aplican cuando un usuario inicia una sesi&oacute;n de escritorio o una aplicaci&oacute;n administrada por Desktop Manager. Se recuperan todos los perfiles correspondientes del usuario o el host que ejecuta la aplicaci&oacute;n; la configuraci&oacute;n se integra con los valores predeterminados locales de la aplicaci&oacute;n y los predeterminados del usuario. Los perfiles sirven para proporcionar a la aplicaci&oacute;n una serie de valores predeterminados que se administran de manera centralizada o para establecer una configuraci&oacute;n obligatoria.</p>
<p>T&eacute;rminos que hace falta conocer:</p>
<ul><li><p><i>Dep&oacute;sito de configuraci&oacute;n</i>: Contenedor en forma de &aacute;rbol de la organizaci&oacute;n y el dominio, junto con los perfiles que tiene almacenados.</p>
</li>
<li><p><i>Dominio</i>: Elemento del &aacute;rbol del dominio. Representa una agrupaci&oacute;n dentro de una red de sistemas. Puede contener dominios y hosts.</p>
</li>
<li><p><i>Elemento</i>: Objeto l&oacute;gico al que se pueden asignar datos de configuraci&oacute;n. Los usuarios, grupos o roles, y las organizaciones son ejemplos de entidades que Desktop Manager conoce</p>
</li>
<li><p><i>LDAP</i>: Protocolo ligero de acceso a directorios (LDAP, del ingl&eacute;s Lightweight Directory Access Protocol). LDAP es un protocolo de servicio de directorios que funciona mediante TCP/IP. La definici&oacute;n de LDAP se explica en RFC 1777 'The Lightweight Directory Access Protocol' (Protocolo ligero de acceso a directorios).</p>
</li>
<li><p><i>Organizaci&oacute;n</i>: Elemento del &aacute;rbol de organizaciones. Representa una organizaci&oacute;n o suborganizaci&oacute;n, por ejemplo &#8220;Centro de llamadas&#8221;. Puede contener organizaciones, usuarios o roles.</p>
</li>
<li><p><i>Perfil</i>: Contenedor asignado para valores de configuraci&oacute;n. Se almacena en un dep&oacute;sito de configuraciones y se puede asignar a elementos.</p>
</li>
</ul>
<br />
</body>
</html>
