  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>&Aacute;rea de navegaci&oacute;n  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgcm"></A><h3>&Aacute;rea de navegaci&oacute;n</h3>
<p>El &aacute;rbol de navegaci&oacute;n sirve para buscar y seleccionar un elemento en los &aacute;rboles de la organizaci&oacute;n y el dominio. El &aacute;rbol refleja la jerarqu&iacute;a de los elementos. Un tri&aacute;ngulo de color azul a la izquierda del nombre de un nodo denota la existencia de subnodos. Si se hace clic en el tri&aacute;ngulo azul, se expande el nodo y aparecen en pantalla los subnodos.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>De forma predeterminada, en pantalla s&oacute;lo se muestran 10 subnodos de un nodo expandido. Si el nodo tiene m&aacute;s de 10 subnodos, el &#8220;nodo&#8221; und&eacute;cimo no hace referencia a un elemento, sino que indica que hay otros nodos que no se muestran: &#8220;... algunos elementos no se muestran en pantalla&#8221;. Si se hace clic en este &#8220;nodo&#8221;, se abre la funci&oacute;n Buscar.</p>
<hr size="1" noshade></p><p>Para seleccionar un elemento, b&uacute;squelo en el &aacute;rbol y haga clic en el elemento. Tras haber seleccionado un elemento, &eacute;ste se resalta y el &aacute;rea de contenido muestra los perfiles heredados y asignados del elemento.</p>
<p>Adem&aacute;s, la navegaci&oacute;n proporciona un mecanismo para b&uacute;squedas recursivas  (consulte <A HREF="gbgpa.html#gbgpa">B&uacute;squeda de un elemento</A>) y no recursivas (consulte <A HREF="gbgqt.html#gbgqt">Uso de la funci&oacute;n Buscar</A>), a fin de poder encontrar elementos de las tres jerarqu&iacute;as. Si se hace clic en el bot&oacute;n Buscar, se abre la ventana Buscar.</p>
<br />
</body>
</html>
