  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Creaci&oacute;n de un dep&oacute;sito de configuraci&oacute;n  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgcn"></A><h4>Creaci&oacute;n de un dep&oacute;sito de configuraci&oacute;n</h4>
<p>Un dep&oacute;sito de configuraci&oacute;n consiste en una ubicaci&oacute;n de almacenamiento de la informaci&oacute;n jer&aacute;rquica de la organizaci&oacute;n, adem&aacute;s de los datos de asignaciones y perfiles de cada elemento.</p>
<h5>Pasos</h5><ol><li><p><b>En la tabla Dep&oacute;sitos de configuraci&oacute;n, haga clic en Nuevo</b></p><p>Se abre el Asistente para nuevo dep&oacute;sito de configuraci&oacute;n. Este asistente sirve para crear un dep&oacute;sito de configuraci&oacute;n que se utiliza con Desktop Manager.</p>
</li>
<li><p><b>En el campo Nombre de dep&oacute;sito, asigne un nombre al nuevo dep&oacute;sito de configuraci&oacute;n y haga clic en Siguiente.</b></p></li>
<li><p><b>En la lista Tipo de dep&oacute;sito, seleccione la clase de dep&oacute;sito.</b> </p><p>El asistente es v&aacute;lido para configurar tres tipos de dep&oacute;sitos:</p>
<ul><li><p>LDAP: La jerarqu&iacute;a se toma de LDAP y todos los datos se almacenan en LDAP.</p>
</li>
<li><p>Basado en archivos: La jerarqu&iacute;a se toma de un archivo y todos los datos se almacenan en directorios y archivos.</p>
</li>
<li><p>H&iacute;brido: La jerarqu&iacute;a se toma de LDAP, pero todos los datos se almacenan en directorios y archivos.</p>
</li>
</ul>
</li>
<li><p><b>Haga clic en el bot&oacute;n Siguiente.</b></p></li>
<li><p><b>Especifique los detalles del servidor LDAP que desea configurar para este dep&oacute;sito.</b> </p><p>Hace falta indicar el nombre de host y el puerto en que se ejecuta el servidor. Asimismo, se puede elegir si conectarse o no con este servidor mediante SSL. </p>
</li>
<li><p><b>La configuraci&oacute;n que se haya elegido en los pasos anteriores condiciona los pasos posteriores.</b> <b>Siga las instrucciones que proporciona el asistente.</b></p></li>
</ol>
<br />
</body>
</html>
