  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Opciones avanzadas  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgdh"></A><h3>Opciones avanzadas</h3>
<p>En la p&aacute;gina Opciones avanzadas se especifican las opciones avanzadas del perfil activo. La p&aacute;gina contiene dos opciones principales:</p>
<ul><li><p>Aplicable desde: permite colocar el perfil en otra ubicaci&oacute;n de almacenamiento del &aacute;rbol de la organizaci&oacute;n o el dominio. Al cambiar la ubicaci&oacute;n de almacenamiento tambi&eacute;n lo hacen los elementos a los que se puede asignar o aplicar el perfil. Eso se debe a que un perfil s&oacute;lo se puede asignar al elemento en el que se almacena, o a los elementos del sub&aacute;rbol debajo del elemento en que se almacena.</p>
<hr size="1" noshade><p><IMG ALT="Caution" src="graphics/caution.gif"> <b>Precauci&oacute;n &#8211; </b>El par&aacute;metro &#8220;Aplicable desde&#8221; se puede modificar de forma que la organizaci&oacute;n resultante contradiga la norma mencionada antes. Por ejemplo, sucede al mover un perfil abajo en la jerarqu&iacute;a del &aacute;rbol, y una asignaci&oacute;n que conecta el perfil con un elemento debajo de la ubicaci&oacute;n de almacenamiento del perfil, despu&eacute;s de moverlo, conecta el perfil con el mismo elemento. Sin embargo, ahora el elemento est&aacute; por encima de la ubicaci&oacute;n de almacenamiento del perfil. Si se intenta, la acci&oacute;n se cancela y aparece en pantalla un mensaje de advertencia.</p><hr size="1" noshade></li>
<li><p>Orden de combinaci&oacute;n: determina el orden en que se combinan todos los perfiles que se almacenan en el mismo elemento. </p>
<p>Como se puede asignar m&aacute;s de un perfil a un solo elemento, y como m&aacute;s de un perfil puede definir el mismo valor, debe establecerse el orden de combinaci&oacute;n de los perfiles con un solo elemento. De esta forma, se solucionan los conflictos de un solo valor que se define en dos o m&aacute;s perfiles asignados al mismo elemento.</p>
<p>Para establecer el orden de combinaci&oacute;n, primero se emplea la ubicaci&oacute;n de almacenamiento. Primero se combina el perfil almacenado en el elemento que se halla m&aacute;s cerca de la ra&iacute;z del &aacute;rbol. Despu&eacute;s se combina el perfil almacenado en un &aacute;rea m&aacute;s profunda de la jerarqu&iacute;a del &aacute;rbol. La configuraci&oacute;n de un perfil que se combina posteriormente sobrescribe la de un perfil que se ha combinado antes.</p>
</li>
</ul>
<p>Consulte <A HREF="gbgqu.html#gbgqu">Cambio de la ubicaci&oacute;n de la aplicaci&oacute;n</A>, <A HREF="gbgqe.html#gbgqe">Asignaci&oacute;n de un orden de combinaci&oacute;n a un perfil</A></p>
<br />
</body>
</html>
