  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Visualizaci&oacute;n de Configuraci&oacute;n vigente  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgoz"></A><h3>Visualizaci&oacute;n de Configuraci&oacute;n vigente</h3>
<p>La vista Configuraci&oacute;n vigente es de s&oacute;lo lectura. Presenta los valores vigentes de un elemento determinado, por ejemplo organizaciones, dominios o hosts.</p>
<p>La configuraci&oacute;n vigente de un usuario es el resultado de un proceso de combinaci&oacute;n en el que intervienen los valores de configuraci&oacute;n almacenados en los correspondientes niveles y roles de la organizaci&oacute;n, y el usuario. Los valores de configuraci&oacute;n combinados de un elemento espec&iacute;fico se pueden ver en una ventana Configuraci&oacute;n vigente aparte. De esta forma, se facilita la verificaci&oacute;n y depuraci&oacute;n de errores. Tambi&eacute;n se puede imprimir un informe sobre la configuraci&oacute;n vigente y almacenarlo para finalidades de archivo.</p>
<h5>Pasos</h5><ol><li><p><b>En la tabla Perfiles asignados, haga clic en el bot&oacute;n Configuraci&oacute;n vigente.</b></p><p>Al abrirse, en el &aacute;rbol de navegaci&oacute;n aparece la configuraci&oacute;n vigente del elemento seleccionado.</p>
<p>La ventana Configuraci&oacute;n vigente se divide en dos secciones:</p>
<ul><li><p>En la secci&oacute;n Modificar los par&aacute;metros de configuraci&oacute;n vigentes, en el &aacute;rea para la especificaci&oacute;n de la configuraci&oacute;n vigente se elige el &aacute;rbol que se tener en cuenta. En la opci&oacute;n Seleccionar un elemento del &aacute;rbol de organizaci&oacute;n se eligen las entidades para generar un informe sobre la configuraci&oacute;n vigente. Con el bot&oacute;n Examinar, busque en el &aacute;rbol de la organizaci&oacute;n o el dominio un elemento que seleccionar.</p>
</li>
<li><p>La secci&oacute;n Configuraci&oacute;n vigente muestra los datos siguientes:</p>
<ul><li><p>La ubicaci&oacute;n del elemento seleccionado en la jerarqu&iacute;a y el nombre de host.</p>
</li>
<li><p>La fecha y la hora de generaci&oacute;n del informe sobre la configuraci&oacute;n vigente.</p>
</li>
<li><p>En la secci&oacute;n Perfiles implicados, los perfiles que han intervenido en la generaci&oacute;n del informe sobre la configuraci&oacute;n vigente del elemento activo. Aparecen en orden de combinaci&oacute;n de m&aacute;s a menos pertinente. Cada perfil es un v&iacute;nculo que abre la ventana del Editor de perfiles del perfil.</p>
</li>
<li><p>El &aacute;rea Resumen de configuraci&oacute;n muestra los valores de configuraci&oacute;n del informe sobre la configuraci&oacute;n vigente, agrupados por categor&iacute;as. El &aacute;rea Resumen de configuraci&oacute;n se compone de los campos Nombre, Valor y Estado.</p>
<p>En la columna Estado se encuentran las entradas del tipo &#8220;Definido en &lt;pofileName>&#8221;, donde &lt;profileName> es un v&iacute;nculo que abre la ventana del Editor de perfiles de ese perfil en la p&aacute;gina Valores de configuraci&oacute;n y busca el valor concreto dentro de dicho perfil.</p>
</li>
</ul>
</li>
</ul>
</li>
<li><p><b>El informe sobre la configuraci&oacute;n vigente se puede modificar en cualquiera de sus par&aacute;metros para, a continuaci&oacute;n, hacer clic en el bot&oacute;n Generar configuraci&oacute;n que se aplica, que se encuentra en la parte superior de la ventana Configuraci&oacute;n vigente.</b> </p><p>As&iacute;, en la ventana Configuraci&oacute;n vigente aparece un informe nuevo.</p>
</li>
<li><p><b>Si desea imprimir el informe sobre la configuraci&oacute;n vigente, haga clic en el bot&oacute;n Imprimir, en la parte superior o inferior de la p&aacute;gina Configuraci&oacute;n vigente.</b></p></li>
</ol>
<br />
</body>
</html>
