  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Visualizaci&oacute;n y edici&oacute;n de los valores de configuraci&oacute;n de perfiles  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgot"></A><h4>Visualizaci&oacute;n y edici&oacute;n de los valores de configuraci&oacute;n de perfiles</h4>
<h5>Pasos</h5><ol><li><p><b>Para ver el valor de configuraci&oacute;n de un perfil, b&uacute;squelo en la lista de categor&iacute;as que hay en la parte derecha de la p&aacute;gina.</b></p><p>Los valores de configuraci&oacute;n se organizan jer&aacute;rquicamente en categor&iacute;as que equivalen a las opciones de configuraci&oacute;n de aplicaciones de escritorio como StarOffice™, Mozilla™, Evolution o Gnome. </p>
</li>
<li><p><b>Haga clic en un valor de configuraci&oacute;n.</b></p><p>Aparece en pantalla la configuraci&oacute;n del perfil con los valores vigentes en ese momento. Si es preciso, se proporciona informaci&oacute;n contextual complementaria, por ejemplo los efectos de valores determinados o el intervalo de valores permitido. </p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Si en lugar de un valor de configuraci&oacute;n selecciona una categor&iacute;a, en pantalla aparece una tabla con valores de categor&iacute;as o  subcategor&iacute;as.</p>
<hr size="1" noshade></p></li>
<li><p><b>En cada valor de configuraci&oacute;n se puede establecer un valor concreto o no definirlo.</b></p><p>Si opta por no definirlo, el valor de este perfil no afecta a la aplicaci&oacute;n, que recurre al valor predeterminado que se haya proporcionado de f&aacute;brica. En general, las listas y aplicaciones del Editor de perfiles establecen el valor predeterminado mediante texto de ayuda adicional o, si es posible, con marcador directamente en la lista de opciones del valor.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Es importante saber que varios perfiles pueden afectar al mismo usuario. Por ejemplo, se puede crear un perfil con valores para una determinada organizaci&oacute;n. Estos valores quedan, autom&aacute;ticamente, disponibles para todos los usuarios que pertenecen a la misma organizaci&oacute;n. Asimismo, se pueden definir perfiles adicionales con valores de configuraci&oacute;n para suborganizaciones. Estos valores pueden sobrescribir los de la organizaci&oacute;n superior; por ejemplo, se pueden definir distintas configuraciones de proxy para suborganizaciones, sin cambiar otros valores. As&iacute; pues, la configuraci&oacute;n que se aplica a un usuario concreto puede llegar a ser el resultado de un proceso de combinaci&oacute;n que abarca todos los perfiles asignados a la organizaci&oacute;n, las suborganizaciones y, probablemente, el usuario. </p>
<hr size="1" noshade></p><p><hr size="1" noshade><p><b>Sugerencia&#8211; </b>En algunos casos, quiz&aacute; desee controlar el proceso de combinaci&oacute;n y aplicar un valor de configuraci&oacute;n concreto, lo que significa que otros perfiles no puedan sobrescribir dicho valor y definir otro. El Editor de perfiles posibilita especificar un comportamiento de combinaci&oacute;n concreto para cada valor. El valor predeterminado es el de que "los perfiles pueden sobrescribir" un valor. Si anula esta selecci&oacute;n, ni el valor ni otros perfiles podr&aacute;n sobrescribir su valor.</p>
<hr size="1" noshade></p></li>
</ol>
<br />
</body>
</html>
