  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>B&uacute;squeda de un elemento  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgpa"></A><h4>B&uacute;squeda de un elemento</h4>
<p>La funci&oacute;n Buscar permite la b&uacute;squeda recursiva de un elemento en la jerarqu&iacute;a de la organizaci&oacute;n o el dominio. Busca tanto en el subdirectorio del elemento como en el resto de directorios secundarios. Si desea buscar &uacute;nicamente en el subdirectorio de un elemento, utilice la funci&oacute;n Buscar.</p>
<p>La funci&oacute;n de b&uacute;squeda abre la ventana Buscar. En ella, se puede especificar una b&uacute;squeda m&aacute;s precisa.</p>
<h5>Pasos</h5><ol><li><p><b>En el campo de b&uacute;squeda, escriba el nombre total o parcial del elemento que desea buscar.</b></p><p><hr size="1" noshade><p><b>Nota &#8211; </b>La b&uacute;squeda no distingue may&uacute;sculas y min&uacute;sculas; as&iacute;, por ejemplo, la cadena de caracteres de b&uacute;squeda "bc" detectar&aacute; "ABC" y "bcd". Un asterisco (*) denota una secuencia arbitraria de caracteres dentro de una cadena de caracteres de b&uacute;squeda. En la cadena de caracteres de b&uacute;squeda se puede incluir m&aacute;s de un asterisco. Un campo vac&iacute;o equivale a un campo con la cadena de caracteres de b&uacute;squeda  &#8220;*&#8221;.</p>
<hr size="1" noshade></p></li>
<li><p><b>Haga clic en el bot&oacute;n Buscar.</b></p><p>Se abre la ventana Buscar. La cadena de caracteres insertada en el campo de b&uacute;squeda del &aacute;rea de navegaci&oacute;n pasa del campo de b&uacute;squeda a la ventana Buscar y, de forma autom&aacute;tica, se inicia la b&uacute;squeda de dicha cadena de caracteres. Los resultados aparecen en una tabla; en ella, figuran el nombre, el tipo y la ruta de los elementos que se hayan encontrado.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Se puede obtener un m&aacute;ximo de 100 resultados de b&uacute;squeda.</p>
<hr size="1" noshade></p><p>Si la b&uacute;squeda no obtiene resultados, o si el campo de b&uacute;squeda del &aacute;rea de navegaci&oacute;n est&aacute; vac&iacute;o, se puede escribir el nombre de un elemento en el campo de b&uacute;squeda de la ventana Buscar. </p>
<p><hr size="1" noshade><p><b>Sugerencia &#8211; </b>Si desea buscar un tipo de elemento en particular, por ejemplo, &#8220;Buscar dominios&#8221;, utilice la lista de modificadores de tipo que hay junto al campo de b&uacute;squeda.</p>
<hr size="1" noshade></p></li>
<li><p><b>Si lo necesita, incorpore opciones de b&uacute;squeda m&aacute;s precisas; para ello, haga clic en el bot&oacute;n Mostrar opciones avanzadas.</b></p><p>Las opciones avanzadas son:</p>
<ul><li><p>Restringir a: puede indicar el elemento en el que el algoritmo de b&uacute;squeda debe comenzar a buscar por el &aacute;rbol.</p>
</li>
<li><p>Resultados mostrados por p&aacute;gina: permite establecer el n&uacute;mero de resultados que deben mostrarse en pantalla en la p&aacute;gina de la tabla de resultados.</p>
</li>
</ul>
</li>
<li><p><b>Haga clic de nuevo en el bot&oacute;n Buscar para ver los resultados de una b&uacute;squeda nueva o con criterios de b&uacute;squeda modificados.</b></p><p><hr size="1" noshade><p><b>Nota &#8211; </b>Al hacer clic en el bot&oacute;n Restablecer, se restauran todos los par&aacute;metros predeterminados de b&uacute;squeda y se elimina el contenido del campo de b&uacute;squeda.</p>
<hr size="1" noshade></p></li>
</ol>
<br />
</body>
</html>
