  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Sincronizaci&oacute;n de dep&oacute;sitos de configuraci&oacute;n  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgqm"></A><h4>Sincronizaci&oacute;n de dep&oacute;sitos de configuraci&oacute;n</h4>
<p>Con Desktop Manager se pueden administrar en paralelo varios extremos. De esta forma, se puede definir un extremo para verificar y otro para la producci&oacute;n final. Los cambios de configuraci&oacute;n se pueden comprobar primero en el extremo de verificaci&oacute;n. A partir de entonces, se puede <i>sincronizar</i> partes o todo el extremo de verificaci&oacute;n con el de producci&oacute;n, a fin de aplicar los cambios pertinentes con rapidez y seguridad en el sistema de producci&oacute;n. Este m&eacute;todo tambi&eacute;n es v&aacute;lido para un mecanismo sencillo de copia de seguridad y restauraci&oacute;n del extremo de producci&oacute;n. En la ventana de sincronizaci&oacute;n se pueden efectuar las acciones siguientes.</p>
<p></p>
<h5>Pasos</h5><ol><li><p><b>En la ventana Dep&oacute;sitos de configuraci&oacute;n, seleccione el dep&oacute;sito que desea sincronizar.</b></p><p>Se abre la ventana de sincronizaci&oacute;n.</p>
</li>
<li><p><b>En la lista Dep&oacute;sito de configuraci&oacute;n de origen, seleccione el dep&oacute;sito de origen pertinente.</b></p><p>El dep&oacute;sito de origen que act&uacute;a como origen de los cambios se puede cambiar. Este dep&oacute;sito <i>no</i> se cambia. </p>
</li>
<li><p>(Opcional) <b>Se puede restringir el dep&oacute;sito de origen si hace clic en el bot&oacute;n Cambiar que hay junto a Punto de inicio de origen.</b></p><p>Esta acci&oacute;n establece como punto de origen de la sincronizaci&oacute;n otro elemento que no es el root.</p>
<p>Se abre un cuadro de di&aacute;logo para buscar el elemento de la organizaci&oacute;n o el dominio. Tras seleccionar un elemento como Punto de inicio de origen aparece la nueva ruta.</p>
</li>
<li><p><b>En la lista Dep&oacute;sito de configuraci&oacute;n de destino, elija un dep&oacute;sito de destino.</b></p><p>El dep&oacute;sito de destino que act&uacute;a como destino de los cambios se puede cambiar. Este dep&oacute;sito <i>se</i> cambia. </p>
</li>
<li><p>(Opcional) <b>Se puede restringir el dep&oacute;sito de destino si hace clic en el bot&oacute;n Cambiar que hay junto a Punto de inicio de destino.</b> </p><p>Esta acci&oacute;n establece como destino de la sincronizaci&oacute;n otro elemento que no es el root.</p>
<p>Se abre un cuadro de di&aacute;logo para buscar el elemento de la organizaci&oacute;n o el dominio. Tras seleccionar un elemento como Punto de inicio de destino aparece la nueva ruta.</p>
</li>
<li><p><b>Haga clic en el bot&oacute;n Comparar.</b></p><p>Los dos &aacute;rboles se comparan; las diferencias se reflejan en una tabla. </p>
</li>
<li><p><b>Habilite las casillas de verificaci&oacute;n junto a las filas de la tabla con los perfiles que desea sincronizar y haga clic en el bot&oacute;n Sincronizar.</b> </p><p>Despu&eacute;s de la sincronizaci&oacute;n, el dep&oacute;sito de destino coincide con el de origen respecto a los perfiles seleccionados.</p>
</li>
</ol>
<br />
</body>
</html>
