  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Ventana Configuraci&oacute;n de dep&oacute;sitos  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgqa"></A><h2>Ventana Configuraci&oacute;n de dep&oacute;sitos</h2>
<p>Esta ventana es la ubicaci&oacute;n de almacenamiento de los datos de configuraci&oacute;n que necesita para configurar las aplicaciones, as&iacute; como la ubicaci&oacute;n de almacenamiento de los datos de la jerarqu&iacute;a organizativa, junto con los perfiles y las asignaciones de cada elemento. En la ventana Configuraci&oacute;n de dep&oacute;sitos se pueden crear, utilizar y sincronizar dep&oacute;sitos.</p>
<p>La ventana consta de un encabezado y la lista Dep&oacute;sitos de configuraci&oacute;n.</p>
<p>El encabezado proporciona varios v&iacute;nculos generales. En la parte superior est&aacute; la barra de utilidades, con los cuatro v&iacute;nculos siguientes (de izquierda a derecha):</p>
<ul><li><p>El bot&oacute;n Console abre la p&aacute;gina de inicio de Java Web Console.</p>
</li>
<li><p>El bot&oacute;n Versi&oacute;n abre una ventana con la informaci&oacute;n sobre la versi&oacute;n de Desktop Manager.</p>
</li>
<li><p>Cerrar sesi&oacute;n sale de Java Web Console y de Configuration Manager, y devuelve al usuario a la p&aacute;gina de inicio de sesi&oacute;n.</p>
</li>
<li><p>El bot&oacute;n Ayuda abre las p&aacute;ginas de la Ayuda en l&iacute;nea. </p>
</li>
</ul>
<p>En la parte inferior del encabezado figuran los nombres del producto, del servidor y del administrador que ha iniciado la sesi&oacute;n.</p>
<p>Consulte <A HREF="gbgpt.html#gbgpt">Tabla Configuraci&oacute;n de dep&oacute;sitos</A>, <A HREF="gbgcn.html#gbgcn">Creaci&oacute;n de un dep&oacute;sito de configuraci&oacute;n</A></p>
<br />
</body>
</html>
