  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Uso de la funci&oacute;n Buscar  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgqt"></A><h4>Uso de la funci&oacute;n Buscar</h4>
<p>Esta funci&oacute;n permite realizar una b&uacute;squeda precisa de los elementos que son descendientes <i>directos</i> del elemento expandido. Contrasta con la funci&oacute;n de b&uacute;squeda, que proporciona una b&uacute;squeda recursiva de elementos.</p>
<h5>Pasos</h5><ol><li><p><b>En el &aacute;rbol de navegaci&oacute;n, haga clic en el nodo Algunos elementos no se muestran en pantalla.</b></p><p>Se abre la ventana Buscar.</p>
</li>
<li><p><b>En el campo Buscar, escriba total o parcialmente la cadena de caracteres que desea encontrar.</b> </p><p>La b&uacute;squeda no distingue may&uacute;sculas de min&uacute;sculas y no es estricta; por ejemplo, la cadena de b&uacute;squeda "bc" encontrar&aacute; "ABC" y "bcd". Un asterisco (*) denota una secuencia arbitraria de caracteres dentro de una cadena de caracteres de b&uacute;squeda. En la cadena de caracteres de b&uacute;squeda se puede incluir m&aacute;s de un asterisco. Un campo vac&iacute;o equivale a un campo con la cadena de caracteres de b&uacute;squeda  &#8220;*&#8221;.</p>
</li>
<li><p><b>Haga clic en el bot&oacute;n Buscar.</b></p><p>Se muestra en pantalla una lista de resultados. Pueden aparecer un m&aacute;ximo de 100 resultados.</p>
</li>
<li><p><b>Para agregar un elemento encontrado al &aacute;rbol de navegaci&oacute;n, haga clic en el elemento en la lista de resultados.</b></p><p>Se cierra la ventana Buscar y el elemento se incorpora a la lista de subnodos del &aacute;rbol de navegaci&oacute;n.</p>
</li>
</ol>
<br />
</body>
</html>
