  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Cr&eacute;ation d'un r&eacute;f&eacute;rentiel de configuration  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgcn"></A><h4>Cr&eacute;ation d'un r&eacute;f&eacute;rentiel de configuration</h4>
<p>Un r&eacute;f&eacute;rentiel de configuration est un emplacement dans lequel sont stock&eacute;es les informations de hi&eacute;rarchie organisationnelle ainsi que celles des profils et des assignations de chaque &eacute;l&eacute;ment.</p>
<h5>&Eacute;tapes</h5><ol><li><p><b>Dans le tableau R&eacute;f&eacute;rentiels de configuration, cliquez sur Nouveau.</b></p><p>L'assistant Nouveau r&eacute;f&eacute;rentiel de configuration s'ouvre. Cet assistant sert &agrave; cr&eacute;er un r&eacute;f&eacute;rentiel de configuration pour Desktop Manager.</p>
</li>
<li><p><b>Dans le champ Nom du r&eacute;f&eacute;rentiel, saisissez un nom pour le nouveau r&eacute;f&eacute;rentiel de configuration, puis cliquez sur Suivant.</b></p></li>
<li><p><b>Dans la liste des types de r&eacute;f&eacute;rentiel, s&eacute;lectionnez un type.</b> </p><p>L'assistant peut configurer trois types de r&eacute;f&eacute;rentiel :</p>
<ul><li><p>LDAP : le LDAP fournit les informations sur la hi&eacute;rarchie et les donn&eacute;es sont stock&eacute;es sur ce serveur.</p>
</li>
<li><p>Fichier : un fichier fournit les informations sur la hi&eacute;rarchie et les donn&eacute;es sont stock&eacute;es dans des r&eacute;pertoires et des fichiers.</p>
</li>
<li><p>Hybride : le LDAP fournit les informations sur la hi&eacute;rarchie, mais les donn&eacute;es sont stock&eacute;es dans des r&eacute;pertoires et des fichiers.</p>
</li>
</ul>
</li>
<li><p><b>Cliquez sur le bouton Suivant.</b></p></li>
<li><p><b>Saisissez les d&eacute;tails du serveur LDAP &agrave; configurer pour ce r&eacute;f&eacute;rentiel.</b> </p><p>Le nom d'h&ocirc;te et le port sur lequel le serveur s'ex&eacute;cute sont requis. Vous pouvez &eacute;galement choisir de connecter ce serveur via SSL. </p>
</li>
<li><p><b>Les &eacute;tapes suivantes d&eacute;pendent des choix effectu&eacute;s pr&eacute;c&eacute;demment.</b> <b>Suivez les instructions fournies par l'assistant.</b></p></li>
</ol>
<br />
</body>
</html>
