  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title> Introduction  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgce"></A><h2> Introduction</h2>
<p>Desktop Manager est un outil permettant de g&eacute;rer de fa&ccedil;on centralis&eacute;e les param&egrave;tres de configuration des applications de bureau &agrave; l'aide de <i>profils</i>. Desktop Manager dispose de fonctions d'affichage et d'assignation de profils pour les divers &eacute;l&eacute;ments de la hi&eacute;rarchie d'une organisation ou d'un domaine. D&egrave;s l'ouverture d'une session ou d'une application g&eacute;r&eacute;e par Desktop Manager, le syst&egrave;me applique des profils &agrave; l'utilisateur. Tous les profils correspondant &agrave; l'utilisateur ou &agrave; l'h&ocirc;te qui ex&eacute;cute l'application sont extraits et leurs param&egrave;tres sont int&eacute;gr&eacute;s aux param&egrave;tres locaux par d&eacute;faut de l'application, ainsi qu'aux param&egrave;tres personnalis&eacute;s de l'utilisateur. Les profils peuvent &ecirc;tre utilis&eacute;s pour fournir &agrave; l'application un ensemble de param&egrave;tres par d&eacute;faut g&eacute;r&eacute;s de mani&egrave;re centralis&eacute;e ou pour appliquer des param&egrave;tres obligatoires.</p>
<p>Termes &agrave; conna&icirc;tre :</p>
<ul><li><p><i>R&eacute;f&eacute;rentiel de configuration</i> : conteneur des arborescences de l'organisation et du domaine dans lesquelles sont stock&eacute;s les profils.</p>
</li>
<li><p><i>Domaine</i> : &eacute;l&eacute;ment de l'arborescence du domaine. Il s'agit d'un domaine de r&eacute;seau. Cet &eacute;l&eacute;ment peut contenir plusieurs domaines et h&ocirc;tes.</p>
</li>
<li><p><i>&Eacute;l&eacute;ment</i> : objet logique auquel les donn&eacute;es de configuration peuvent &ecirc;tre assign&eacute;es. Les utilisateurs, les r&ocirc;les/groupes et les organisations sont des exemples d'entit&eacute;s reconnues par Desktop Manager.</p>
</li>
<li><p><i>LDAP</i> : Lightweight Directory Access Protocol. LDAP est un protocole de service d'annuaire ex&eacute;cut&eacute; via TCP/IP. Les d&eacute;tails de LDAP sont d&eacute;finis dans la RFC 1777 'The Lightweight Directory Access Protocol'.</p>
</li>
<li><p><i>Organisation</i> : &eacute;l&eacute;ment de l'arborescence de l'organisation. Il s'agit d'une organisation ou d'une sous-organisation telle qu'un centre d'appels. Cet &eacute;l&eacute;ment peut contenir des organisations, des utilisateurs ou des r&ocirc;les.</p>
</li>
<li><p><i>Profil</i> : conteneur nomm&eacute; regroupant des param&egrave;tres de configuration. Il est stock&eacute; dans un r&eacute;f&eacute;rentiel de configuration et peut &ecirc;tre assign&eacute; &agrave; des &eacute;l&eacute;ments.</p>
</li>
</ul>
<br />
</body>
</html>
