  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Options avanc&eacute;es  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgdh"></A><h3>Options avanc&eacute;es</h3>
<p>La page Options avanc&eacute;es permet de sp&eacute;cifier les options avanc&eacute;es du profil actuel. Deux options principales sont disponibles sur cette page :</p>
<ul><li><p>Applicable de : permet le d&eacute;placement du profil vers un autre emplacement de stockage dans l'arborescence de l'organisation ou du domaine. Ce changement d'emplacement modifie &eacute;galement le jeu d'&eacute;l&eacute;ments auquel le profil peut &ecirc;tre assign&eacute; ou appliqu&eacute;. En effet, un profil ne peut &ecirc;tre assign&eacute; qu'&agrave; l'&eacute;l&eacute;ment dans lequel il est stock&eacute; ou aux sous-&eacute;l&eacute;ments de celui-ci dans l'arborescence.</p>
<hr size="1" noshade><p><IMG ALT="Caution" src="graphics/caution.gif"> <b>Attention &#8211; </b>Le param&egrave;tre Applicable de doit &ecirc;tre modifi&eacute; de fa&ccedil;on &agrave; respecter la r&egrave;gle mentionn&eacute;e ci-dessus. Par exemple, supposons que vous d&eacute;placez un profil vers le bas de l'arborescence et qu'une assignation relie le profil &agrave; un &eacute;l&eacute;ment situ&eacute; sous l'emplacement de stockage du profil. Apr&egrave;s le d&eacute;placement du profil, celui-ci doit &ecirc;tre reli&eacute; au m&ecirc;me &eacute;l&eacute;ment. Or, l'&eacute;l&eacute;ment est &agrave; pr&eacute;sent situ&eacute; au-dessus du profil. Cette action est donc annul&eacute;e et g&eacute;n&egrave;re un message d'avertissement.</p><hr size="1" noshade></li>
<li><p>Ordre de fusion : sp&eacute;cifie l'ordre dans lequel les profils stock&eacute;s dans le m&ecirc;me &eacute;l&eacute;ment sont fusionn&eacute;s. </p>
<p>La d&eacute;finition de l'ordre de fusion des profils est requise dans la mesure o&ugrave; plusieurs profils peuvent d'une part &ecirc;tre assign&eacute;s &agrave; un seul &eacute;l&eacute;ment et, d'autre part, d&eacute;finir le m&ecirc;me param&egrave;tre. Cela &eacute;vite les conflits tels que la d&eacute;finition d'un param&egrave;tre par plusieurs profils assign&eacute;s au m&ecirc;me &eacute;l&eacute;ment.</p>
<p>L'ordre de fusion se base en priorit&eacute; sur l'emplacement de stockage. Le premier profil fusionn&eacute; est celui qui est stock&eacute; dans l'&eacute;l&eacute;ment situ&eacute; le plus pr&egrave;s de la racine de l'arborescence. Tout profil stock&eacute; &agrave; un emplacement plus &eacute;loign&eacute; de la racine est fusionn&eacute; apr&egrave;s. Lorsqu'un profil est fusionn&eacute;, ses param&egrave;tres &eacute;crasent ceux des profils pr&eacute;c&eacute;dents.</p>
</li>
</ul>
<p>Voir <A HREF="gbgqu.html#gbgqu">Modification de l'emplacement du param&egrave;tre Applicable de</A>, <A HREF="gbgqe.html#gbgqe">Assignation &agrave; un profil</A></p>
<br />
</body>
</html>
