  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Zone de contenu  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgoy"></A><h3>Zone de contenu</h3>
<p>Les informations de chaque &eacute;l&eacute;ment s&eacute;lectionn&eacute; s'affichent dans la zone de contenu de la page Profils &#8212; Vue d'arborescence. Trois tableaux peuvent s'afficher dans cette zone :</p>
<ul><li><p>Profils assign&eacute;s : tableau toujours affich&eacute;, indiquant les profils assign&eacute;s &agrave; l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;. Il se compose de trois colonnes : Nom, Auteur et Derni&egrave;re modification. La valeur de la colonne Derni&egrave;re modification ne change que si un param&egrave;tre du profil est &eacute;dit&eacute;. Si le profil est renomm&eacute;, d&eacute;plac&eacute; ou que sa priorit&eacute; est modifi&eacute;e, cette valeur ne change pas. </p>
<p>Vous pouvez r&eacute;aliser les op&eacute;rations suivantes dans ce tableau :</p>
<ul><li><p><A HREF="gbgni.html#gbgni">Cr&eacute;ation d'un profil</A></p>
</li>
<li><p><A HREF="gbgpr.html#gbgpr">Suppression d'un profil</A></p>
</li>
<li><p><A HREF="gbgpn.html#gbgpn">Assignation d'un profil</A></p>
</li>
<li><p><A HREF="gbgqj.html#gbgqj">Annulation d'une assignation de profil</A></p>
</li>
<li><p><A HREF="gbgpw.html#gbgpw">Attribution d'un nouveau nom &agrave; un profil</A></p>
</li>
<li><p><A HREF="gbgqf.html#gbgqf">Copie et d&eacute;placement d'un profil</A></p>
</li>
<li><p><A HREF="gbgps.html#gbgps">Importation de profils</A></p>
</li>
<li><p><A HREF="gbgqh.html#gbgqh">Exportation de profils</A></p>
</li>
</ul>
</li>
<li><p>Profils h&eacute;rit&eacute;s : tableau affich&eacute; si des profils sont assign&eacute;s &agrave; des &eacute;l&eacute;ments situ&eacute;s, dans la hi&eacute;rarchie, au-dessus de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;. Le tableau r&eacute;pertorie alors ces profils. Ce tableau se compose de deux colonnes : Nom et Assign&eacute; &agrave;. La colonne Assign&eacute; &agrave; indique le chemin d'acc&egrave;s et le nom de l'&eacute;l&eacute;ment auquel le profil est assign&eacute;.</p>
</li>
<li><p>Utilisateurs et r&ocirc;les : tableau affich&eacute; lorsque l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; est un utilisateur ou un r&ocirc;le. S'il s'agit d'un utilisateur, les r&ocirc;les dont il est membre s'affichent, le cas &eacute;ch&eacute;ant, dans le tableau des r&ocirc;les. S'il s'agit d'un r&ocirc;le, les utilisateurs qui en sont membres s'affichent, le cas &eacute;ch&eacute;ant, dans le tableau des utilisateurs.</p>
</li>
</ul>
<br />
</body>
</html>
