  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Affichage et &eacute;dition des param&egrave;tres de configuration d'un profil  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgot"></A><h4>Affichage et &eacute;dition des param&egrave;tres de configuration d'un profil</h4>
<h5>&Eacute;tapes</h5><ol><li><p><b>Pour afficher un param&egrave;tre de configuration d'un profil, parcourez la liste des cat&eacute;gories situ&eacute;e &agrave; droite de la page.</b></p><p>Les param&egrave;tres de configuration sont hi&eacute;rarchis&eacute;s en cat&eacute;gories. Chacune d'elles correspond directement aux options de configuration d'applications de bureau telles que StarOffice&#153;, Mozilla&#153;, Evolution ou Gnome. </p>
</li>
<li><p><b>Cliquez sur le param&egrave;tre de configuration de votre choix.</b></p><p>Les param&egrave;tres disponibles du profil s&eacute;lectionn&eacute; s'affichent. Le cas &eacute;ch&eacute;ant, des informations contextuelles suppl&eacute;mentaires, par exemple les effets de chaque param&egrave;tre ou la plage de valeurs autoris&eacute;es, s'affichent. </p>
<p><hr size="1" noshade><p><b>Remarque &#8211; </b>Si vous s&eacute;lectionnez une cat&eacute;gorie au lieu d'un param&egrave;tre de configuration, un tableau contenant la liste des param&egrave;tres de cat&eacute;gorie ou des sous-cat&eacute;gories s'affiche.</p>
<hr size="1" noshade></p></li>
<li><p><b>Sp&eacute;cifiez les valeurs des param&egrave;tres de configuration de votre choix.</b></p><p>Si aucune valeur n'est d&eacute;finie pour un param&egrave;tre de profil, l'application utilise la valeur par d&eacute;faut sp&eacute;cifi&eacute;e par le fabricant. La valeur par d&eacute;faut d'une application ou d'un param&egrave;tre propos&eacute; dans l'&eacute;diteur de profil est g&eacute;n&eacute;ralement d&eacute;finie sur la base d'un texte d'aide suppl&eacute;mentaire ou, lorsque c'est possible, via un marqueur ins&eacute;r&eacute; directement dans la liste des options du param&egrave;tre.</p>
<p><hr size="1" noshade><p><b>Remarque &#8211; </b>Un utilisateur peut &ecirc;tre concern&eacute; par plusieurs profils. Par exemple, si vous cr&eacute;ez un profil en d&eacute;finissant des param&egrave;tres sp&eacute;cifiques &agrave; une organisation, ces param&egrave;tres sont automatiquement mis &agrave; la disposition de tous les utilisateurs. De m&ecirc;me, il est possible de d&eacute;finir des profils suppl&eacute;mentaires pour les diff&eacute;rentes sous-organisations, en leur affectant des param&egrave;tres de configuration qui remplacent ceux de l'organisation parente. Ainsi, vous pouvez sp&eacute;cifier des param&egrave;tres de Proxy sp&eacute;cifiques &agrave; chaque sous-organisation, tandis que d'autres param&egrave;tres restent inchang&eacute;s. L'ensemble des param&egrave;tres effectifs d'un utilisateur correspond donc &agrave; la fusion des profils assign&eacute;s &agrave; l'organisation, aux sous-organisations et, &eacute;ventuellement, &agrave; l'utilisateur lui-m&ecirc;me. </p>
<hr size="1" noshade></p><p><hr size="1" noshade><p><b>Astuce &#8211; </b>Pour contr&ocirc;ler le processus de fusion et d&eacute;finir un param&egrave;tre de configuration exclusif, c'est-&agrave;-dire, qu'aucun autre profil ne peut &eacute;craser ou &eacute;diter, ouvrez l'&eacute;diteur de profil et d&eacute;finissez le comportement du param&egrave;tre lors de la fusion. Par d&eacute;faut, les param&egrave;tres peuvent &ecirc;tre &eacute;cras&eacute;s par d'autres profils. D&eacute;s&eacute;lectionnez l'option par d&eacute;faut pour rendre le param&egrave;tre exclusif.</p>
<hr size="1" noshade></p></li>
</ol>
<br />
</body>
</html>
