  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Affichage des param&egrave;tres effectifs  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgoz"></A><h3>Affichage des param&egrave;tres effectifs</h3>
<p>La vue Param&egrave;tres effectifs, en lecture seule, affiche les param&egrave;tres de configuration effectifs d'un &eacute;l&eacute;ment donn&eacute;, par exemple une organisation, un domaine ou un h&ocirc;te.</p>
<p>Les param&egrave;tres effectifs d'un utilisateur sont issus d'une fusion incluant les param&egrave;tres de configuration stock&eacute;s dans les niveaux et r&ocirc;les de l'organisation, ainsi que ceux de l'utilisateur. Vous pouvez afficher les param&egrave;tres de fusion d'un &eacute;l&eacute;ment s&eacute;lectionn&eacute; dans une fen&ecirc;tre Param&egrave;tres effectifs distincte. Cette fonction s'av&egrave;re utile &agrave; la v&eacute;rification et au d&eacute;bogage. Vous pouvez &eacute;galement imprimer un rapport Param&egrave;tres effectifs et l'archiver, le cas &eacute;ch&eacute;ant.</p>
<h5>&Eacute;tapes</h5><ol><li><p><b>Cliquez sur Param&egrave;tres effectifs dans le tableau Profils assign&eacute;s.</b></p><p>&Agrave; la premi&egrave;re ouverture, les param&egrave;tres effectifs de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; dans l'arborescence de navigation s'affichent. </p>
<p>La fen&ecirc;tre Param&egrave;tres effectifs se compose de deux sections :</p>
<ul><li><p>La section Modifier les valeurs de param&egrave;tres effectifs, comprenant une zone de cr&eacute;ation de param&egrave;tres effectifs &agrave; partir d'une arborescence et l'option S&eacute;lectionner un &eacute;l&eacute;ment dans l'arborescence du domaine, qui permet de choisir l'entit&eacute; pour laquelle le rapport Param&egrave;tres effectifs doit &ecirc;tre g&eacute;n&eacute;r&eacute;. Cliquez sur Parcourir pour s&eacute;lectionner un &eacute;l&eacute;ment dans l'arborescence du domaine ou de l'organisation.</p>
</li>
<li><p>La section Param&egrave;tres effectifs est constitu&eacute;e des champs suivants :</p>
<ul><li><p>emplacement de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; dans la hi&eacute;rarchie et le nom d'h&ocirc;te ;</p>
</li>
<li><p>date et heure &agrave; laquelle le rapport Param&egrave;tres effectifs a &eacute;t&eacute; g&eacute;n&eacute;r&eacute; ;</p>
</li>
<li><p>section Profils impliqu&eacute;s indiquant la liste des profils impliqu&eacute;s dans la g&eacute;n&eacute;ration du rapport Param&egrave;tres effectifs pour l'&eacute;l&eacute;ment actuel. Ces param&egrave;tres sont r&eacute;pertori&eacute;s selon l'ordre de fusion, du plus important au moins important. Chaque profil repr&eacute;sente un lien vers la fen&ecirc;tre &Eacute;diteur de profil correspondant &agrave; ce profil.</p>
</li>
<li><p>La zone R&eacute;sum&eacute; des param&egrave;tres affiche par cat&eacute;gories les param&egrave;tres de configuration utilis&eacute;s dans le rapport Param&egrave;tres effectifs actuel. Ce r&eacute;sum&eacute; est compos&eacute; de trois champs : nom, valeur et statut.</p>
<p>La colonne Statut contient des entr&eacute;es de type &#8220;D&eacute;fini dans &lt;nomProfil>, o&ugrave; &lt;nomProfil> est un lien permettant d'ouvrir l'&Eacute;diteur de profil dans l'onglet Param&egrave;tres de configuration et d'acc&eacute;der &agrave; un param&egrave;tre particulier au sein de ce profil.</p>
</li>
</ul>
</li>
</ul>
</li>
<li><p><b>Pour modifier un rapport Param&egrave;tres effectifs g&eacute;n&eacute;r&eacute;, &eacute;ditez un param&egrave;tre effectif important et cliquez sur G&eacute;n&eacute;rer les param&egrave;tres effectifs, en haut de la fen&ecirc;tre Param&egrave;tres effectifs.</b> </p><p>Un nouveau rapport s'affiche dans la fen&ecirc;tre Param&egrave;tres effectifs.</p>
</li>
<li><p><b>Pour afficher un rapport Param&egrave;tres effectifs, cliquez sur Imprimer, en haut ou en bas de la fen&ecirc;tre Param&egrave;tres effectifs.</b></p></li>
</ol>
<br />
</body>
</html>
