  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Recherche d'un &eacute;l&eacute;ment  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgpa"></A><h4>Recherche d'un &eacute;l&eacute;ment</h4>
<p>La fonction Recherche lance une recherche r&eacute;cursive d'un &eacute;l&eacute;ment dans la hi&eacute;rarchie de domaine ou d'organisation. Cette recherche porte aussi bien sur l'enfant direct d'un &eacute;l&eacute;ment que sur ses descendants. Pour que la recherche porte uniquement sur les enfants directs d'un &eacute;l&eacute;ment, utilisez la fonction Rechercher.</p>
<p>La fonction Recherche ouvre une fen&ecirc;tre Recherche dans laquelle vous pouvez d&eacute;finir des crit&egrave;res avanc&eacute;s.</p>
<h5>&Eacute;tapes</h5><ol><li><p><b>Dans le champ de recherche, saisissez le nom complet ou partiel de l'&eacute;l&eacute;ment &agrave; rechercher.</b></p><p><hr size="1" noshade><p><b>Remarque &#8211; </b>La recherche n'est ni sensible &agrave; la casse ni limitative. Par exemple, si vous saisissez la cha&icirc;ne "bc", les r&eacute;sultats de la recherche incluront "ABC" et "bcd". Un ast&eacute;risque (*) indique une s&eacute;quence de caract&egrave;res arbitraire dans une cha&icirc;ne recherch&eacute;e. Le nombre et l'emplacement des ast&eacute;risques dans la cha&icirc;ne de recherche ne font l'objet d'aucune restriction. Un champ vide &eacute;quivaut &agrave; un champ avec la cha&icirc;ne de recherche "*".</p>
<hr size="1" noshade></p></li>
<li><p><b>Cliquez sur le bouton Recherche.</b></p><p>La fen&ecirc;tre Recherche s'ouvre. Toute cha&icirc;ne saisie dans le champ de recherche de la zone de navigation s'affiche dans cette fen&ecirc;tre et la recherche d&eacute;marre automatiquement. Les r&eacute;sultats de la recherche s'affichent dans un tableau, avec le nom, le type et le chemin d'acc&egrave;s aux &eacute;l&eacute;ments correspondants.</p>
<p><hr size="1" noshade><p><b>Remarque &#8211; </b>Le nombre de r&eacute;sultats est limit&eacute; &agrave; 100.</p>
<hr size="1" noshade></p><p>Si aucun &eacute;l&eacute;ment ne correspond &agrave; la recherche ou si le champ de recherche de la zone de navigation est vide, saisissez le nom d'un &eacute;l&eacute;ment dans le champ de recherche de la fen&ecirc;tre Recherche. </p>
<p><hr size="1" noshade><p><b>Astuce &#8211; </b>Recherchez un type d'&eacute;l&eacute;ment sp&eacute;cifique, tel que les domaines de recherche, &agrave; l'aide de la liste des modificateurs de type, situ&eacute;e en regard du champ de recherche.</p>
<hr size="1" noshade></p></li>
<li><p><b>Si n&eacute;cessaire, ajoutez des crit&egrave;res avanc&eacute;s de recherche &agrave; l'aide du bouton Afficher les options avanc&eacute;es.</b></p><p>Les options avanc&eacute;es sont les suivantes :</p>
<ul><li><p>Limiter &agrave; : permet de d&eacute;finir l'&eacute;l&eacute;ment de l'arborescence &agrave; partir duquel l'algorithme de recherche doit d&eacute;marrer.</p>
</li>
<li><p>R&eacute;sultats affich&eacute;s par page : permet de d&eacute;finir le nombre de r&eacute;sultats par page du tableau de r&eacute;sultats.</p>
</li>
</ul>
</li>
<li><p><b>Cliquez de nouveau sur Recherche pour afficher les r&eacute;sultats de la nouvelle recherche.</b></p><p><hr size="1" noshade><p><b>Remarque &#8211; </b>Le bouton R&eacute;tablir efface les donn&eacute;es du champ de recherche et r&eacute;tablit les options de recherche par d&eacute;faut.</p>
<hr size="1" noshade></p></li>
</ol>
<br />
</body>
</html>
