  <!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head> <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8"><!-- ident      "%Z%%M% %I%     %E% SMI" --><title>Synchronisation des r&eacute;f&eacute;rentiels de configuration  </title><script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script> <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script> <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script> 
<meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>
<body class="HlpBdy"><A NAME="gbgqm"></A><h4>Synchronisation des r&eacute;f&eacute;rentiels de configuration</h4>
<p>Desktop Manager permet de g&eacute;rer simultan&eacute;ment plusieurs moteurs de traitement. Ainsi, il est possible de d&eacute;finir un moteur de traitement pour effectuer les tests et un second destin&eacute; &agrave; la production finale. Le premier sert &agrave; d&eacute;finir et &agrave; &eacute;valuer les changements de configuration. Ensuite, il peut &ecirc;tre enti&egrave;rement ou partiellement <i>synchronis&eacute;</i> avec le second afin de garantir une application rapide et fiable des changements requis au niveau du syst&egrave;me de production. Vous pouvez utiliser cette m&eacute;thode dans le cadre d'une sauvegarde et d'une restauration simple du moteur de traitement de production. R&eacute;alisez cette op&eacute;ration dans la fen&ecirc;tre Synchronisation.</p>
<p></p>
<h5>&Eacute;tapes</h5><ol><li><p><b>Dans la fen&ecirc;tre R&eacute;f&eacute;rentiels de configuration, s&eacute;lectionnez le r&eacute;f&eacute;rentiel &agrave; synchroniser.</b></p><p>La fen&ecirc;tre Synchronisation s'ouvre.</p>
</li>
<li><p><b>S&eacute;lectionnez le r&eacute;f&eacute;rentiel source dans la liste R&eacute;f&eacute;rentiel de configuration source.</b></p><p>Vous pouvez changer le r&eacute;f&eacute;rentiel source servant de source aux modifications. Ce r&eacute;f&eacute;rentiel n'est <i>pas</i> modifi&eacute;. </p>
</li>
<li><p>(facultatif)<b> Pour limiter le r&eacute;f&eacute;rentiel source, cliquez sur Modifier, en regard du champ Point de d&eacute;part source.</b></p><p>Cette op&eacute;ration sp&eacute;cifie comme point de d&eacute;part de la synchronisation un &eacute;l&eacute;ment qui n'est pas l'&eacute;l&eacute;ment racine.</p>
<p>Dans la bo&icirc;te de dialogue qui s'affiche, acc&eacute;dez &agrave; l'&eacute;l&eacute;ment du domaine ou de l'organisation. Une fois l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;, le nouveau chemin s'affiche dans le champ Point de d&eacute;part source.</p>
</li>
<li><p><b>S&eacute;lectionnez le r&eacute;f&eacute;rentiel cible dans la liste R&eacute;f&eacute;rentiel de configuration cible.</b></p><p>Vous pouvez changer le r&eacute;f&eacute;rentiel source servant de cible aux modifications. Ce r&eacute;f&eacute;rentiel <i>est</i> modifi&eacute;. </p>
</li>
<li><p>(facultatif) <b>Pour limiter le r&eacute;f&eacute;rentiel cible, cliquez sur Modifier, en regard du champ Point de d&eacute;part cible.</b> </p><p>Cette op&eacute;ration sp&eacute;cifie comme cible de la synchronisation un &eacute;l&eacute;ment qui n'est pas l'&eacute;l&eacute;ment racine.</p>
<p>Dans la bo&icirc;te de dialogue qui s'affiche, acc&eacute;dez &agrave; l'&eacute;l&eacute;ment du domaine ou de l'organisation. Une fois l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;, le nouveau chemin s'affiche dans le champ Point de d&eacute;part cible.</p>
</li>
<li><p><b>Cliquez sur Comparer.</b></p><p>Les deux arborescences sont compar&eacute;es et leurs diff&eacute;rences r&eacute;pertori&eacute;es dans un tableau. </p>
</li>
<li><p><b>Cochez la case en regard de chaque profil &agrave; synchroniser, puis cliquez sur Synchroniser.</b> </p><p>Une fois la synchronisation termin&eacute;e, les profils s&eacute;lectionn&eacute;s du r&eacute;f&eacute;rentiel cible correspondent &agrave; ceux du r&eacute;f&eacute;rentiel source.</p>
</li>
</ol>
<br />
</body>
</html>
